sy=eval(input("输入上月水表吨数"))
by=eval(input("输入本月水表吨数"))
rs=eval(input("输入家庭人数"))
db=input("是否低保(y/n)")
if(db=="y"):
    sl=by-sy-6
else:
    sl=by-sy
if(rs<=4):
    if(sl<=0):
        sf=0
    elif(sl<=15):
        sf=sl*2.58
    elif(sl>15 and sl<=22):
        sf=15*2.58+(sl-15)*3.34
    else:
        sf=15*2.58+7*3.34+(sl-22)*4.09
elif(rs>4):
    if(sl<=0):
        sf=0
    elif(sl<=rs*4):
        sf=2.58*sl
    elif(sl<=rs*5 and sl>rs*4):
        sf=rs*4*2.58+(sl-rs*4)*3.34
    else:
        sf=rs*4*2.58+(rs*5-rs*4)*3.34+(sl-rs*5)*4.09
print("用水吨数(减免后){:.2f}水费{:.2f}".format(sl,sf))

#：对四口之家及以下以户为单位进行计量，五口之家及以上按人均计量办法。
#对四口之家及以下户：第一级水价为15吨及以下，按2.58元每吨计费；第二级水价为22吨及以下，按3.34元每吨计费；第二级水价为超过22吨，按4.09元每吨计费。
#对五口之家及以上户：第一级水价为每人每月4吨及以下，按2.58元每吨计费；第二级水价为每人每月5吨及以下，按3.34元每吨计费；第二级水价为超过每人每月5吨，按4.09元每吨计费。
#此外，对于低保居民，每户每月减免6立方米的水费